In [126]:
import pandas as pd
import numpy as np

In [127]:
df = pd.read_csv('../data/tips.csv')

In [128]:
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [129]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [130]:
df.info

<bound method DataFrame.info of      total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>

In [131]:
def last_digits(number):
    return str(number)[-2:]

In [132]:
last_digits(345345)

'45'

In [133]:
df['new_col'] = df['total_bill'].apply(last_digits)

In [134]:
df.head()

   total_bill   tip     sex smoker  day    time  size new_col
0       16.99  1.01  Female     No  Sun  Dinner     2      99
1       10.34  1.66    Male     No  Sun  Dinner     3      34
2       21.01  3.50    Male     No  Sun  Dinner     3      01
3       23.68  3.31    Male     No  Sun  Dinner     2      68
4       24.59  3.61  Female     No  Sun  Dinner     4      59

In [135]:
df['total_bill'].mean()

19.78594262295082

In [136]:
def yelp(price):
    if price<10:
        return '$'
    elif price >= 10 and price<30:
        return '$$'
    else:
        return '$$$'

In [137]:
df['yelp'] = df['total_bill'].apply(yelp)

In [138]:
df

     total_bill   tip     sex smoker   day    time  size new_col yelp
0         16.99  1.01  Female     No   Sun  Dinner     2      99   $$
1         10.34  1.66    Male     No   Sun  Dinner     3      34   $$
2         21.01  3.50    Male     No   Sun  Dinner     3      01   $$
3         23.68  3.31    Male     No   Sun  Dinner     2      68   $$
4         24.59  3.61  Female     No   Sun  Dinner     4      59   $$
..          ...   ...     ...    ...   ...     ...   ...     ...  ...
239       29.03  5.92    Male     No   Sat  Dinner     3      03   $$
240       27.18  2.00  Female    Yes   Sat  Dinner     2      18   $$
241       22.67  2.00    Male    Yes   Sat  Dinner     2      67   $$
242       17.82  1.75    Male     No   Sat  Dinner     2      82   $$
243       18.78  3.00  Female     No  Thur  Dinner     2      78   $$

[244 rows x 9 columns]

In [139]:
df['total_bill'].apply(lambda num:num*2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [140]:
df.head()

   total_bill   tip     sex smoker  day    time  size new_col yelp
0       16.99  1.01  Female     No  Sun  Dinner     2      99   $$
1       10.34  1.66    Male     No  Sun  Dinner     3      34   $$
2       21.01  3.50    Male     No  Sun  Dinner     3      01   $$
3       23.68  3.31    Male     No  Sun  Dinner     2      68   $$
4       24.59  3.61  Female     No  Sun  Dinner     4      59   $$

In [141]:
def quality(total_bill, tip):
    if tip/total_bill >0.25:
        return "high"
    else:
        return "low"

In [142]:
df['other_tip']=df[['total_bill','tip']].apply(lambda df: quality(df['total_bill'], df['tip']),axis=1)

In [143]:
df['other_tip'] = np.vectorize(quality)(df['total_bill'], df['tip'])

In [144]:
df

,total_bill,tip,sex,smoker,day,time,size,new_col,yelp,other_tip
0,16.99,1.01,Female,No,Sun,Dinner,2,99,$$,low
1,10.34,1.66,Male,No,Sun,Dinner,3,34,$$,low
2,21.01,3.50,Male,No,Sun,Dinner,3,01,$$,low
3,23.68,3.31,Male,No,Sun,Dinner,2,68,$$,low
4,24.59,3.61,Female,No,Sun,Dinner,4,59,$$,low
...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,03,$$,low
240,27.18,2.00,Female,Yes,Sat,Dinner,2,18,$$,low
241,22.67,2.00,Male,Yes,Sat,Dinner,2,67,$$,low
242,17.82,1.75,Male,No,Sat,Dinner,2,82,$$,low
243,18.78,3.00,Female,No,Thur,Dinner,2,78,$$,low

In [145]:
setup = """
import numpy as np
import pandas as pd
df = pd.read_csv('../data/tips.csv')
def quality(total_bill, tip):
    if tip/total_bill >0.25:
        return "high"
    else:
        return "low"
"""

In [146]:
one = """
df['other_tip']=df[['total_bill','tip']].apply(lambda df: quality(df['total_bill'], df['tip']),axis=1)
"""

In [147]:
two = """
df['other_tip'] = np.vectorize(quality)(df['total_bill'], df['tip'])
"""

In [148]:
import timeit

In [149]:
timeit.timeit(setup=setup, stmt=one, number=500)

2.3319268999998712

In [150]:
timeit.timeit(setup=setup, stmt=two, number=500)

0.21404549999988376

In [151]:
df = pd.read_csv('../data/tips.csv')

In [152]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [153]:
df.sort_values(['tip', 'size'])

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
111        7.25   1.00  Female     No   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
236       12.60   1.00    Male    Yes   Sat  Dinner     2
0         16.99   1.01  Female     No   Sun  Dinner     2
..          ...    ...     ...    ...   ...     ...   ...
141       34.30   6.70    Male     No  Thur   Lunch     6
59        48.27   6.73    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

In [154]:
df['total_bill'].max()

50.81

In [155]:
df['total_bill'].idxmax()

170

In [156]:
df.corr()

            total_bill       tip      size
total_bill    1.000000  0.675734  0.598315
tip           0.675734  1.000000  0.489299
size          0.598315  0.489299  1.000000

In [157]:
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [158]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [159]:
df['sex'].replace(['Female','Male'], ['F','M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [160]:
mymap = {'Female': 'F', 'Male':'M'}
df['sex'].map(mymap)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [161]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [162]:
simple_df = pd.DataFrame([1,2,2], ['a', 'b', 'c'])

In [163]:
simple_df.duplicated()

a    False
b    False
c     True
dtype: bool

In [164]:
df[df['total_bill'].between(10,20, inclusive=True)]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
8         15.04  1.96    Male     No   Sun  Dinner     2
9         14.78  3.23    Male     No   Sun  Dinner     2
10        10.27  1.71    Male     No   Sun  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
234       15.53  3.00    Male    Yes   Sat  Dinner     2
235       10.07  1.25    Male     No   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[130 rows x 7 columns]

In [165]:
df.nlargest(2, 'tip')

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3
212       48.33   9.0  Male     No  Sat  Dinner     4

In [166]:
df.sample(5)

     total_bill   tip     sex smoker  day    time  size
169       10.63  2.00  Female    Yes  Sat  Dinner     2
161       12.66  2.50    Male     No  Sun  Dinner     2
69        15.01  2.09    Male    Yes  Sat  Dinner     2
222        8.58  1.92    Male    Yes  Fri   Lunch     1
93        16.32  4.30  Female    Yes  Fri  Dinner     2

In [167]:
df.sample(frac=0.2)

     total_bill   tip     sex smoker   day    time  size
32        15.06  3.00  Female     No   Sat  Dinner     2
215       12.90  1.10  Female    Yes   Sat  Dinner     2
213       13.27  2.50  Female    Yes   Sat  Dinner     2
106       20.49  4.06    Male    Yes   Sat  Dinner     2
143       27.05  5.00  Female     No  Thur   Lunch     6
98        21.01  3.00    Male    Yes   Fri  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
34        17.78  3.27    Male     No   Sat  Dinner     2
18        16.97  3.50  Female     No   Sun  Dinner     3
138       16.00  2.00    Male    Yes  Thur   Lunch     2
127       14.52  2.00  Female     No  Thur   Lunch     2
2         21.01  3.50    Male     No   Sun  Dinner     3
182       45.35  3.50    Male    Yes   Sun  Dinner     3
219       30.14  3.09  Female    Yes   Sat  Dinner     4
201       12.74  2.01  Female    Yes  Thur   Lunch     2
39        31.27  5.00    Male     No   Sat  Dinner     3
123       15.95  2.00    Male     No  Thur   Lunch     2
58        11.24  1.76    Male    Yes   Sat  Dinner     2
62        11.02  1.98    Male    Yes   Sat  Dinner     2
161       12.66  2.50    Male     No   Sun  Dinner     2
177       14.48  2.00    Male    Yes   Sun  Dinner     2
190       15.69  1.50    Male    Yes   Sun  Dinner     2
225       16.27  2.50  Female    Yes   Fri   Lunch     2
111        7.25  1.00  Female     No   Sat  Dinner     1
117       10.65  1.50  Female     No  Thur   Lunch     2
10        10.27  1.71    Male     No   Sun  Dinner     2
63        18.29  3.76    Male    Yes   Sat  Dinner     4
0         16.99  1.01  Female     No   Sun  Dinner     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2
12        15.42  1.57    Male     No   Sun  Dinner     2
222        8.58  1.92    Male    Yes   Fri   Lunch     1
202       13.00  2.00  Female    Yes  Thur   Lunch     2
116       29.93  5.07    Male     No   Sun  Dinner     4
50        12.54  2.50    Male     No   Sun  Dinner     2
83        32.68  5.00    Male    Yes  Thur   Lunch     2
168       10.59  1.61  Female    Yes   Sat  Dinner     2
151       13.13  2.00    Male     No   Sun  Dinner     2
165       24.52  3.48    Male     No   Sun  Dinner     3
5         25.29  4.71    Male     No   Sun  Dinner     4
19        20.65  3.35    Male     No   Sat  Dinner     3
236       12.60  1.00    Male    Yes   Sat  Dinner     2
110       14.00  3.00    Male     No   Sat  Dinner     2
187       30.46  2.00    Male    Yes   Sun  Dinner     5
188       18.15  3.50  Female    Yes   Sun  Dinner     3
11        35.26  5.00  Female     No   Sun  Dinner     4
141       34.30  6.70    Male     No  Thur   Lunch     6
31        18.35  2.50    Male     No   Sat  Dinner     4
64        17.59  2.64    Male     No   Sat  Dinner     3
85        34.83  5.17  Female     No  Thur   Lunch     4

In [168]:
# MISSING VALUES

In [169]:
np.nan == np.nan

False

In [170]:
np.nan is np.nan

True

In [171]:
df = pd.read_csv('../data/Movies.csv')
df

,Unnamed: 0,id,adult,title,original_language,overview,title.1,popularity,release_date,vote_average,vote_count
0,0,278,False,The Shawshank Redemption,en,Framed in the 1940s for the double murder of h...,The Shawshank Redemption,86.715,1994-09-23,8.7,21988
1,1,19404,False,Dilwale Dulhania Le Jayenge,hi,"Raj is a rich, carefree, happy-go-lucky second...",Dilwale Dulhania Le Jayenge,54.110,1995-10-19,8.7,3769
2,2,238,False,The Godfather,en,"Spanning the years 1945 to 1955, a chronicle o...",The Godfather,121.661,1972-03-14,8.7,16371
3,3,424,False,Schindler's List,en,The true story of how businessman Oskar Schind...,Schindler's List,55.646,1993-12-15,8.6,13038
4,4,240,False,The Godfather Part II,en,In the continuing saga of the Corleone crime f...,The Godfather Part II,62.479,1974-12-20,8.6,9868
...,...,...,...,...,...,...,...,...,...,...,...
9975,9975,19543,False,Anacondas: Trail of Blood,en,"A genetically created Anaconda, cut in half, r...",Anacondas: Trail of Blood,33.694,2009-02-27,4.9,227
9976,9976,240483,False,Robot Overlords,en,Earth has been conquered by robots from anothe...,Robot Overlords,32.508,2015-01-29,4.9,213
9977,9977,14863,False,Anaconda 3: Offspring,en,Cancer-terminal tycoon Peter Murdoch's secret ...,Anaconda 3: Offspring,32.083,2008-01-01,4.9,240
9978,9978,214597,False,Fright Night 2: New Blood,en,"By day Gerri Dandridge is a sexy professor, bu...",Fright Night 2: New Blood,10.698,2013-08-31,4.9,230
9979,9979,11802,False,Space Chimps,en,Three chimps are sent into space to explore th...,Space Chimps,13.966,2008-06-25,4.9,366

In [172]:
df.isnull().sum()

Unnamed: 0            0
id                    0
adult                 0
title                 0
original_language     0
overview             11
title.1               0
popularity            0
release_date          0
vote_average          0
vote_count            0
dtype: int64

In [173]:
df[df['overview'].isnull()]

,Unnamed: 0,id,adult,title,original_language,overview,title.1,popularity,release_date,vote_average,vote_count
4187,4187,38537,False,Nati stanchi,it,NaN,Nati stanchi,5.600,2002-03-01,6.8,211
7094,7094,31359,False,Would I Lie to You? 2,fr,NaN,Would I Lie to You? 2,5.461,2001-02-07,6.2,327
8016,8016,2029,False,Tanguy,fr,NaN,Tanguy,9.547,2001-11-21,6.0,389
8575,8575,57114,False,"Amore, bugie e calcetto",en,NaN,"Amore, bugie e calcetto",6.234,2008-04-04,5.8,200
9348,9348,17413,False,Incognito,fr,NaN,Incognito,5.532,2009-04-28,5.5,213
9491,9491,516043,False,Arrivano i prof,it,NaN,Arrivano i prof,6.949,2018-05-01,5.4,341
9680,9680,154512,False,Lightning Strike,it,NaN,Lightning Strike,7.627,2012-12-13,5.3,216
9853,9853,42426,False,A spasso nel tempo - L'avventura continua,it,NaN,A spasso nel tempo - L'avventura continua,4.406,1997-12-11,5.1,209
9883,9883,77000,False,Bar Sport,it,NaN,Bar Sport,4.817,2011-10-21,5.0,205
9950,9950,42436,False,Natale in crociera,it,NaN,Natale in crociera,4.810,2007-12-14,4.9,364
9972,9972,408238,False,The New Adventures of Cinderella,fr,NaN,The New Adventures of Cinderella,5.649,2017-10-18,4.9,229

In [174]:
df.dropna()

,Unnamed: 0,id,adult,title,original_language,overview,title.1,popularity,release_date,vote_average,vote_count
0,0,278,False,The Shawshank Redemption,en,Framed in the 1940s for the double murder of h...,The Shawshank Redemption,86.715,1994-09-23,8.7,21988
1,1,19404,False,Dilwale Dulhania Le Jayenge,hi,"Raj is a rich, carefree, happy-go-lucky second...",Dilwale Dulhania Le Jayenge,54.110,1995-10-19,8.7,3769
2,2,238,False,The Godfather,en,"Spanning the years 1945 to 1955, a chronicle o...",The Godfather,121.661,1972-03-14,8.7,16371
3,3,424,False,Schindler's List,en,The true story of how businessman Oskar Schind...,Schindler's List,55.646,1993-12-15,8.6,13038
4,4,240,False,The Godfather Part II,en,In the continuing saga of the Corleone crime f...,The Godfather Part II,62.479,1974-12-20,8.6,9868
...,...,...,...,...,...,...,...,...,...,...,...
9975,9975,19543,False,Anacondas: Trail of Blood,en,"A genetically created Anaconda, cut in half, r...",Anacondas: Trail of Blood,33.694,2009-02-27,4.9,227
9976,9976,240483,False,Robot Overlords,en,Earth has been conquered by robots from anothe...,Robot Overlords,32.508,2015-01-29,4.9,213
9977,9977,14863,False,Anaconda 3: Offspring,en,Cancer-terminal tycoon Peter Murdoch's secret ...,Anaconda 3: Offspring,32.083,2008-01-01,4.9,240
9978,9978,214597,False,Fright Night 2: New Blood,en,"By day Gerri Dandridge is a sexy professor, bu...",Fright Night 2: New Blood,10.698,2013-08-31,4.9,230
9979,9979,11802,False,Space Chimps,en,Three chimps are sent into space to explore th...,Space Chimps,13.966,2008-06-25,4.9,366

In [175]:
df['overview']= df['overview'].fillna('empty')

In [176]:
df.head()

,Unnamed: 0,id,adult,title,original_language,overview,title.1,popularity,release_date,vote_average,vote_count
0,0,278,False,The Shawshank Redemption,en,Framed in the 1940s for the double murder of h...,The Shawshank Redemption,86.715,1994-09-23,8.7,21988
1,1,19404,False,Dilwale Dulhania Le Jayenge,hi,"Raj is a rich, carefree, happy-go-lucky second...",Dilwale Dulhania Le Jayenge,54.110,1995-10-19,8.7,3769
2,2,238,False,The Godfather,en,"Spanning the years 1945 to 1955, a chronicle o...",The Godfather,121.661,1972-03-14,8.7,16371
3,3,424,False,Schindler's List,en,The true story of how businessman Oskar Schind...,Schindler's List,55.646,1993-12-15,8.6,13038
4,4,240,False,The Godfather Part II,en,In the continuing saga of the Corleone crime f...,The Godfather Part II,62.479,1974-12-20,8.6,9868

In [177]:
vote = df.groupby(['vote_average', 'vote_count']).mean()

In [178]:
vote.index.levels

FrozenList([[4.9, 5.0, 5.1, 5.2, 5.3, 5.4, 5.5, 5.6, 5.7, 5.8, 5.9, 6.0, 6.1, 6.2, 6.3, 6.4, 6.5, 6.6, 6.7, 6.8, 6.9, 7.0, 7.1, 7.2, 7.3, 7.4, 7.5, 7.6, 7.7, 7.8, 7.9, 8.0, 8.1, 8.2, 8.3, 8.4, 8.5, 8.6, 8.7], [200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, ...]])

In [179]:
vote.loc[[5.1]]

                         Unnamed: 0        id  adult  popularity
vote_average vote_count
5.1          200             9833.5   16995.5  False     11.4190
             201             9813.0  174188.0  False      8.5160
             203             9830.0   37632.0  False     15.0310
             204             9842.0   31586.0  False      8.8500
             205             9810.0   12410.0  False     23.4075
...                             ...       ...    ...         ...
             1815            9835.0    8814.0  False     26.0820
             1841            9852.0   12279.0  False     54.3020
             2038            9803.0    9360.0  False     41.7190
             2265            9799.0     440.0  False    459.0920
             2834            9862.0    2486.0  False     19.7480

[65 rows x 4 columns]

In [180]:
vote.xs(key=5.3, level='vote_average')

             Unnamed: 0             id  adult  popularity
vote_count
202         9646.666667  217872.333333  False      10.992
206         9571.000000  457915.000000  False       8.604
208         9613.000000  369202.000000  False       6.498
210         9663.000000   22084.000000  False       8.281
211         9607.000000  249187.500000  False      16.701
...                 ...            ...    ...         ...
2841        9607.000000    8487.000000  False      25.209
2885        9583.000000    8645.000000  False      88.303
3158        9644.000000  301337.000000  False      25.931
5314        9689.000000   47933.000000  False      70.283
5637        9628.000000   47964.000000  False      51.455

[124 rows x 4 columns]

In [181]:
vote.swaplevel()

                         Unnamed: 0        id  adult  popularity
vote_count vote_average
201        4.9               9942.0   12634.0  False      17.711
205        4.9               9931.0  274626.0  False       7.305
211        4.9               9956.0  339116.0  False       7.050
213        4.9               9976.0  240483.0  False      32.508
214        4.9               9938.0   40281.5  False      10.025
...                             ...       ...    ...         ...
9868       8.6                  4.0     240.0  False      62.479
13038      8.6                  3.0     424.0  False      55.646
3769       8.7                  1.0   19404.0  False      54.110
16371      8.7                  2.0     238.0  False     121.661
21988      8.7                  0.0     278.0  False      86.715

[8658 rows x 4 columns]

In [182]:
vote.sort_index()

                         Unnamed: 0        id  adult  popularity
vote_average vote_count
4.9          201             9942.0   12634.0  False      17.711
             205             9931.0  274626.0  False       7.305
             211             9956.0  339116.0  False       7.050
             213             9976.0  240483.0  False      32.508
             214             9938.0   40281.5  False      10.025
...                             ...       ...    ...         ...
8.6          9868               4.0     240.0  False      62.479
             13038              3.0     424.0  False      55.646
8.7          3769               1.0   19404.0  False      54.110
             16371              2.0     238.0  False     121.661
             21988              0.0     278.0  False      86.715

[8658 rows x 4 columns]

In [183]:
data_one = {'A': ['A0', 'A1','A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']}

In [184]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [185]:
one1 = pd.DataFrame(data_one)

In [186]:
two2 = pd.DataFrame(data_two)

In [187]:
one1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [188]:
two2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [189]:
pd.concat([one1,two2], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [190]:
pd.concat([one1,two2], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [191]:
two2.columns = one1.columns

In [192]:
mypd= pd.concat([one1,two2], axis=0)

In [193]:
mypd.index = range(len(mypd))

In [194]:
mypd

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [195]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4], 'name':['Andrew','Bobo', 'Claire', 'David']})
logins = pd.DataFrame({'log_id':[1,2,3,4], 'name':['Xavier','Andrew', 'Yolanda', 'Bobo']})

In [196]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [197]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [198]:
pd.merge(registrations,logins, how='inner', on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [199]:
pd.merge(logins, registrations, how='inner', on='name')

   log_id    name  reg_id
0       2  Andrew       1
1       4    Bobo       2

In [200]:
pd.merge(left=registrations, right=logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [201]:
pd.merge(left=registrations, right=logins, how='right', on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [202]:
pd.merge(logins, registrations, how='outer', on='name')

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0     Bobo     2.0
4     NaN   Claire     3.0
5     NaN    David     4.0

In [203]:
#pd.merge(registrations,logins, left_index=True, right_on='name', how='inner')

In [204]:
#TEXT METHODS

In [205]:
email = 'pawel@mail.com'

In [206]:
email.split('@')

['pawel', 'mail.com']

In [207]:
'3'.isdigit()

True

In [208]:
names = pd.Series(['andrew', 'bob', 'claire', 'david', '2'])

In [209]:
names.str.upper()

0    ANDREW
1       BOB
2    CLAIRE
3     DAVID
4         2
dtype: object

In [210]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [211]:
tech_fin = ['GOOGL, APPL, AMAZ', 'JMP, BAC, HS']

In [212]:
len(tech_fin)

2

In [213]:
tickers = pd.Series(tech_fin)

In [214]:
tickers.str.split(',', expand=True)

       0      1      2
0  GOOGL   APPL   AMAZ
1    JMP    BAC     HS

In [215]:
messy = pd.Series(['andrew  ', "bo:bo", "   clarine   "])

In [216]:
messy

0         andrew
1            bo:bo
2       clarine
dtype: object

In [217]:
messy.str.replace(':','').str.strip().str.capitalize()

0     Andrew
1       Bobo
2    Clarine
dtype: object

In [218]:
def claen(name):
    name = name.replace(':','')
    name = name.strip()
    name = name.capitalize()
    return  name

In [219]:
messy.apply(claen)

0     Andrew
1       Bobo
2    Clarine
dtype: object

In [220]:
from datetime import datetime

In [221]:
myser = pd.Series(['Nov 3, 1990', '2000-01-01', None])

In [222]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [223]:
time_series= pd.to_datetime(myser)

In [224]:
euro_date = '10-12-2000'

In [225]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [226]:
style_date = '12--Dec--2000'

In [227]:
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [228]:
custom_date = "12th of Dec 2000"

In [229]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [230]:
sales = pd.read_csv('../data/MRTSSM4453USN.csv')

In [231]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
361  2022-02-01           5057
362  2022-03-01           5590
363  2022-04-01           5710
364  2022-05-01           5919
365  2022-06-01           6041

[366 rows x 2 columns]

In [232]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [233]:
sales['DATE'][0].year

1992

In [234]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [235]:
sales = sales.set_index("DATE")

In [236]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2022-02-01           5057
2022-03-01           5590
2022-04-01           5710
2022-05-01           5919
2022-06-01           6041

[366 rows x 1 columns]

In [237]:
sales.resample(rule="A").mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3803.916667
2014-12-31    3949.583333
2015-12-31    4096.333333
2016-12-31    4271.083333
2017-12-31    4385.166667
2018-12-31    4590.750000
2019-12-31    4748.500000
2020-12-31    5525.833333
2021-12-31    5847.000000
2022-12-31    5542.666667

In [238]:
sales = pd.read_csv('../data/MRTSSM4453USN.csv', parse_dates=[0])

In [239]:
sales['DATE'].dt.month

0      1
1      2
2      3
3      4
4      5
      ..
361    2
362    3
363    4
364    5
365    6
Name: DATE, Length: 366, dtype: int64

In [240]:
from sqlalchemy import create_engine

In [241]:
temp_db = create_engine('sqlite:///:memory:')

In [242]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)), columns=['a','b','c','d'])

In [243]:
df

    a   b   c   d
0   4   0  12  90
1   2   7  44  54
2  49  76  98   3
3  32  91  43   7

In [244]:
df.to_sql(name='new_table', con=temp_db)

In [245]:
pd.read_sql(sql='new_table', con=temp_db)

   index   a   b   c   d
0      0   4   0  12  90
1      1   2   7  44  54
2      2  49  76  98   3
3      3  32  91  43   7

In [246]:
pd.read_sql_query(sql="SELECT a,c FROM new_table", con=temp_db)

    a   c
0   4  12
1   2  44
2  49  98
3  32  43

In [248]:
df = pd.read_csv('../data/hotel_bookings.csv')

In [249]:
len(df)

119390

In [254]:
df.isnull().sum().max()

112593

In [256]:
df = df.drop('company', axis=1)

In [259]:
df['country'].value_counts()[:5]

PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
Name: country, dtype: int64

In [263]:
df.groupby('country').count().sort_values('hotel',ascending=False)['hotel']

country
PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
       ...
MLI        1
MMR        1
MRT        1
SMR        1
PYF        1
Name: hotel, Length: 177, dtype: int64

In [269]:
df.sort_values('adr', ascending=False)['adr'].iloc[0]

5400.0

In [270]:
df['adr'].mean()

101.83112153446686

In [271]:
df['total_nights'] = df['stays_in_week_nights'] + df['stays_in_weekend_nights']

In [272]:
round(df['total_nights'].mean(),2)

3.43

In [276]:
sum(df['is_repeated_guest'] == 1)/ len(df) *100

3.191222045397437

In [277]:
df.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,total_nights
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,No Deposit,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01,0
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,No Deposit,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01,0
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,No Deposit,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02,1
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,No Deposit,304.0,0,Transient,75.0,0,0,Check-Out,2015-07-02,1
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240.0,0,Transient,98.0,0,1,Check-Out,2015-07-03,2

In [279]:
df['arrival_date_day_of_month'].apply(lambda day: day in range(1,16)).sum()

58152

In [280]:
def convert(day,month,year):
    return f'{day}-{month}-{year}'

In [281]:
df['date'] = np.vectorize(convert)(df['arrival_date_day_of_month'],
                                   df['arrival_date_month'],
                                   df['arrival_date_year'])

In [282]:
df['date']

0            1-July-2015
1            1-July-2015
2            1-July-2015
3            1-July-2015
4            1-July-2015
               ...
119385    30-August-2017
119386    31-August-2017
119387    31-August-2017
119388    31-August-2017
119389    29-August-2017
Name: date, Length: 119390, dtype: object

In [283]:
df['date'] = pd.to_datetime(df['date'])

In [284]:
df['date'].dt.day_name().value_counts()

Friday       19631
Thursday     19254
Monday       18171
Saturday     18055
Wednesday    16139
Sunday       14141
Tuesday      13999
Name: date, dtype: int64